<?php
namespace Intern\SampleData\RealData;

use Intern\Model\Company;
use Intern\Model\EducationMajor;
use Intern\Model\Job;
use Intern\Model\JobTag;
use Intern\Model\JobType;
use Intern\Provider\DateTimeProvider;

class EducationMajorImport extends DateTimeProvider
{
    private $records =
        [
            'คณะเกษตรศาสตร์',
            'คณะสัตวศาสตร์',
            'คณะประมง',
            'คณะทรัพยากรธรรมชาติและสิ่งแวดล้อม',
            'คณะเทคโนโลยีและการพัฒนาชุมชน',

            'คณะบริหารธุรกิจ',
            'คณะพาณิชยศาสตร์และการบัญชี',
            'คณะวิทยาการจัดการ',
            'คณะบัญชีและการเงินธุรกิจ',

            'เศรษฐศาสตร์',

            'คณะมนุษยศาสตร์',
            'คณะศิลปศาสตร์',
            'คณะอักษรศาสตร์',
            'คณะโบราณคดี',
            'คณะครุศาสตร์อุตสาหกรร',

            'คณะนิติศาสตร์',
            'คณะรัฐศาสตร์',
            'คณะรัฐประศาสนศาสตร์',
            'คณะสังคมศาสตร์',
            'คณะสังคมสงเคราะห์ศาสตร์',

            'คณะนิเทศศาสตร์',
            'คณะวารสารศาสตร์และสื่อสารมวลชน',

            'คณะในกลุ่มวิทยาศาสตร์',
            'คณะเทคโนโลยีสารสนเทศ',
            'คณะวิศวกรรมศาสตร์',
            'คณะศิลปกรรมศาสตร์',

            'คณะครุศาสตร์',
            'คณะครุศาสตร์อุตสาหกรรม',
            'คณะศึกษาศาสตร์',
            'คณะพลศึกษา',

            'คณะสถาปัตยกรรมศาสตร์',

            'คณะแพทยศาสตร์',
            'คณะพยาบาลศาสตร์',
            'คณะเวชศาสตร์เขตร้อน',
            'คณะเภสัชศาสตร์',
            'คณะสาธารณสุขศาสตร์',
            'คณะทันตแพทยศาสตร์',
            'คณะสัตวแพทยศาสตร์',

            'คณะเทคนิคการแพทย์',
            'คณะกายภาพบำบัด',
            'คณะสหเวชศาสตร์',
            'คณะทัศนมาตรศาสตร์',

            'คณะพลศึกษา',
            'คณะวิทยาศาสตร์การกีฬา',
        ];

    function __construct()
    {
        iLog('--- Importing Major ---', true);

        foreach ($this->records as $record) {
            $data = new EducationMajor();
            $data->setName($record);

            if ($data->insertAction()) {
                iLog('* Inserted Major : '.$data->getName());
            }
        }
    }
}
